app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "es"], ["room_number", 123123]]
---
    def create
        @class = SchoolClass.create(class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ? WHERE "school_classes"."id" = ?  [["room_number", 1231234], ["id", 2]]
---
    def update
        @class = SchoolClass.find(params[:id])
        @class.update(class_params)