app/controllers/students_controller.rb

    def update
        @student = Student.find(params[:id])
        @student.first_name = params[:student][:first_name]
        @student.last_name = params[:student][:last_name]
        @student.save
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", nil], ["last_name", nil], ["updated_at", "2019-11-28 15:07:42.274419"], ["id", 6]]